{
  "user_id": "emil.lambert@aerodelft.nl",
  "subject": "Re: Paris Air Show - Young NAG Activities on the 18th of June!",
  "content": "i wanna come",
  "recipients": {
    "to": "Agata.Zarnowska@collins.com, Young@nag.aero",
    "cc": "",
    "bcc": ""
  },
  "email_chain": "Zarnowska, Agata (NLD)\n23 Apr 2025, 17:16 (4 days ago)\nto young@nag.aero\n\nDear Young NAG Ambassadors,\n\n \n\nWe’re excited to invite you to the Paris Air Show 2025! To encourage companies to send their Young Professionals to this prestigious event, Young NAG is organizing side events exclusively for Young NAG members. You’ll get access to selected chalets and booths, and Ambassadors will receive free entrance tickets.\n\n \n\nSpots are limited and assigned on a first come, first serve basis. Make sure to sign up!\n\n \n\nDate: 18th of June 2025 (Wed)\n\nTime: 13:00 - 17:00\n\nLocation: Netherlands Aerospace Group stand at Paris le Bourget\n\nProgramme:\n\nOptional programme – 17th of June (Tue)\n\n19:00-22:00 - Young NAG Dinner in Paris (self-paying participation)\n\nMain programme\n\n13:00-13:30 - Speaker - Lodewijk Asscher\n13:30-15:00 - Tour to chalets and stands - Embraer confirmed, awaiting feedback from other selected companies by Ambassadors: Airbus, ZeroAvia, Lockheed, Clean Aviation, Safran, and Dassault Systemes)\n15:00-15:30 - Panel Discussion - about aviation meeting 2050 NetZero goals\n15:30-17:00 - Drinks hosted at the Dutch stand\n18:00-21:00 - NAG Dinner (optional, self-paying participation)\n\n  \n\nCosts:\n\nUnfortunately, Young NAG cannot fully cover participation costs. Our role here is to create an agenda which will encourage your company to invest in your personal development and support your participation.\n\nCosts covered by Young NAG:\nEntrance tickets\nDrinks\nCosts not covered by Young NAG:\nTransport\nAccommodation\nMeals\n\n \n\nRegistration:\n\nMake sure you sign up soon by responding to this email. Please provide your details:\n\nFirst Name\nLast Name\nCompany\nPhone Number\n\nRegistration closes on May 11th, and the maximum capacity is 15 participants. The registration is first open for Ambassadors; however, if we still have free spots, we will reach out to broader Young NAG community. \n\n \n\nWe are looking forward to seeing you at the Paris Air Show! If you have any questions, please send an email to young@nag.aero.   \n\n \n\nDownload\nAdd to Drive\nSave a copy to Photos\n\n \n\n \n\nBest regards,\n\n \n\nAgata Zarnowska\n\nProject Manager\n\nAdvanced Technology & Laboratories\n\n \n\nC : +31 6 2747 9319\nagata.zarnowska@collins.com\n\n \n\nCollins Aerospace | An RTX Business\n\nInteriors – Advanced Technology and Laboratories\n\nElzenkade 1\n\n3992 AD Houten, Netherlands\n\n \n\ncollinsaerospace.com | LinkedIn | Twitter | Instagram | Facebook | YouTube\n\n \n\nCONFIDENTIALITY WARNING: This message may contain proprietary and/or privileged information of Collins Aerospace and its affiliated companies. If you are not the intended recipient, please 1) Do not disclose, copy, distribute or use this message or its contents. 2) Advise the sender by return email. 3) Delete all copies (including all attachments) from your computer. Your cooperation is greatly appreciated.\n\n ",
  "is_reply": true,
  "timestamp": "2025-04-27T16:26:47.426Z"
}